cmsis-svd/cmsis-svd/data/SiliconLabs/EFR32BG13P733F512GM48.svd
        <register>
          <name>DCDCMISCCTRL</name>
          <description>DCDC Miscellaneous Control Register</description>
          <addressOffset>0x04C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x03107706</resetValue>
          <resetMask>0x377FFF27</resetMask>
          <fields>
            <field>
              <name>LNFORCECCM</name>
              <description>Force DCDC Into CCM Mode in Low Noise Operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPCMPHYSDIS</name>
              <description>Disable LP Mode Hysteresis in the State Machine Control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPCMPHYSHI</name>
              <description>Comparator Threshold on the High Side</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNFORCECCMIMM</name>
              <description>Force DCDC Into CCM Mode Immediately, Based on LNFORCECCM</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PFETCNT</name>
              <description>PFET Switch Number Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NFETCNT</name>
              <description>NFET Switch Number Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPLIMSEL</name>
              <description>Current Limit in Bypass Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPCLIMILIMSEL</name>
              <description>Current Limit Level Selection for Current Limiter in LP Mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNCLIMILIMSEL</name>
              <description>Current Limit Level Selection for Current Limiter in LN Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPCMPBIASEM234H</name>
              <description>LP Mode Comparator Bias Selection for EM23 or EM4H</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIAS0</name>
                  <description>Maximum load current less than 75uA.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS1</name>
                  <description>Maximum load current less than 500uA.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS2</name>
                  <description>Maximum load current less than 2.5mA.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS3</name>
                  <description>Maximum load current less than 10mA.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCZDETCTRL</name>
          <description>DCDC Power Train NFET Zero Current Detector Control Register</description>
          <addressOffset>0x050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000150</resetValue>
          <resetMask>0x00000370</resetMask>
          <fields>
            <field>
              <name>ZDETILIMSEL</name>
              <description>Reverse Current Limit Level Selection for Zero Detector</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZDETBLANKDLY</name>
              <description>Reserved for internal use. Do not change.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCCLIMCTRL</name>
          <description>DCDC Power Train PFET Current Limiter Control Register</description>
          <addressOffset>0x054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000100</resetValue>
          <resetMask>0x00002300</resetMask>
          <fields>
            <field>
              <name>CLIMBLANKDLY</name>
              <description>Reserved for internal use. Do not change.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPLIMEN</name>
              <description>Bypass Current Limit Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCLNCOMPCTRL</name>
          <description>DCDC Low Noise Compensator Control Register</description>
          <addressOffset>0x058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x57204077</resetValue>
          <resetMask>0xF730F1F7</resetMask>
          <fields>
            <field>
              <name>COMPENR1</name>
              <description>Low Noise Mode Compensator R1 Trim Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPENR2</name>
              <description>Low Noise Mode Compensator R2 Trim Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPENR3</name>
              <description>Low Noise Mode Compensator R3 Trim Value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPENC1</name>
              <description>Low Noise Mode Compensator C1 Trim Value</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPENC2</name>
              <description>Low Noise Mode Compensator C2 Trim Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPENC3</name>
              <description>Low Noise Mode Compensator C3 Trim Value</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCLNVCTRL</name>
          <description>DCDC Low Noise Voltage Register</description>
          <addressOffset>0x05C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00007100</resetValue>
          <resetMask>0x00007F02</resetMask>
          <fields>
            <field>
              <name>LNATT</name>
              <description>Low Noise Mode Feedback Attenuation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNVREF</name>
              <description>Low Noise Mode VREF Trim</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCLPVCTRL</name>
          <description>DCDC Low Power Voltage Register</description>
          <addressOffset>0x064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000168</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>LPATT</name>
              <description>Low Power Feedback Attenuation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPVREF</name>
              <description>LP Mode Reference Selection for EM23 and EM4H</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCLPCTRL</name>
          <description>DCDC Low Power Control Register</description>
          <addressOffset>0x06C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x03000000</resetValue>
          <resetMask>0x0700F000</resetMask>
          <fields>
            <field>
              <name>LPCMPHYSSELEM234H</name>
              <description>LP Mode Hysteresis Selection for EM23 and EM4H</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPVREFDUTYEN</name>
              <description>LP Mode Duty Cycling Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPBLANK</name>
              <description>Reserved for internal use. Do not change.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCLNFREQCTRL</name>
          <description>DCDC Low Noise Controller Frequency Control</description>
          <addressOffset>0x070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000000</resetValue>
          <resetMask>0x1F000007</resetMask>
          <fields>
            <field>
              <name>RCOBAND</name>
              <description>LN Mode RCO Frequency Band Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCOTRIM</name>
              <description>Reserved for internal use. Do not change.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCSYNC</name>
          <description>DCDC Read Status Register</description>
          <addressOffset>0x078</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>DCDCCTRLBUSY</name>
              <description>DCDC CTRL Register Transfer Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VMONAVDDCTRL</name>
          <description>VMON AVDD Channel Control</description>
          <addressOffset>0x090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFF0D</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISEWU</name>
              <description>Rise Wakeup</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLWU</name>
              <description>Fall Wakeup</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLTHRESFINE</name>
              <description>Falling Threshold Fine Adjust</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLTHRESCOARSE</name>
              <description>Falling Threshold Coarse Adjust</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISETHRESFINE</name>
              <description>Rising Threshold Fine Adjust</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISETHRESCOARSE</name>
              <description>Rising Threshold Coarse Adjust</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VMONALTAVDDCTRL</name>
          <description>Alternate VMON AVDD Channel Control</description>
          <addressOffset>0x094</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FF0D</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISEWU</name>
              <description>Rise Wakeup</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLWU</name>
              <description>Fall Wakeup</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESFINE</name>
              <description>Threshold Fine Adjust</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESCOARSE</name>
              <description>Threshold Coarse Adjust</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VMONDVDDCTRL</name>
          <description>VMON DVDD Channel Control</description>
          <addressOffset>0x098</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FF0D</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISEWU</name>
              <description>Rise Wakeup</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLWU</name>
              <description>Fall Wakeup</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESFINE</name>
              <description>Threshold Fine Adjust</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESCOARSE</name>
              <description>Threshold Coarse Adjust</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VMONIO0CTRL</name>
          <description>VMON IOVDD0 Channel Control</description>
          <addressOffset>0x09C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FF1D</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISEWU</name>
              <description>Rise Wakeup</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLWU</name>
              <description>Fall Wakeup</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RETDIS</name>
              <description>EM4 IO0 Retention Disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESFINE</name>
              <description>Threshold Fine Adjust</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESCOARSE</name>
              <description>Threshold Coarse Adjust</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM1CTRL</name>
          <description>Memory Control Register</description>
          <addressOffset>0x0B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>RAMPOWERDOWN</name>
              <description>RAM1 Blockset Power-down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None of the RAM blocks powered down</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK1</name>
                  <description>Power down RAM block 1 (address range 0x20030000-0x2003FFFF)</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0TO1</name>
                  <description>Power down RAM blocks 0-1 (address range 0x20020000-0x2003FFFF)</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM2CTRL</name>
          <description>Memory Control Register</description>
          <addressOffset>0x0B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>RAMPOWERDOWN</name>
              <description>RAM2 Blockset Power-down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None of the RAM blocks powered down</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK</name>
                  <description>Power down RAM blocks 0-3</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
